tests/saq/test_phishfry/remove_request.xml

<?xml version='1.0' encoding='utf-8'?><s:Envelope xmlns:e="http://schemas.microsoft.com/exchange/services/2006/errors" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"><s:Header><t:RequestServerVersion Version="Exchange2010_SP2"/><t:ExchangeImpersonation><t:ConnectingSID><t:PrimarySmtpAddress>jdoe@company.com</t:PrimarySmtpAddress></t:ConnectingSID></t:ExchangeImpersonation><t:TimeZoneContext><t:TimeZoneDefinition Id="UTC"/></t:TimeZoneContext></s:Header><s:Body><m:DeleteItem DeleteType="SoftDelete"><m:ItemIds><t:ItemId Id="item_id"/></m:ItemIds></m:DeleteItem></s:Body></s:Envelope>
